app/Http/Controllers/Auth/RegisterController.php

    public function register(Request $request)
    {
        // Validatie van de invoer inclusief de profielfoto
        $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|string|email|max:255|unique:users',
            'password' => 'required|string|min:8|confirmed',
            'profile_picture' => 'nullable|image|mimes:jpeg,png,jpg,gif|max:2048', // Validatie voor profielfoto
        ]);

        // Profielfoto verwerken indien aanwezig
        $profilePicturePath = null;
        if ($request->hasFile('profile_picture')) {
            $profilePicturePath = $request->file('profile_picture')->store('profile_pictures', 'public'); // Opslaan in de 'public' disk
        }

        // Opslaan van de gebruiker met gehasht wachtwoord en profielfoto (indien aanwezig)
        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
            'profile_picture' => $profilePicturePath, // Sla het pad van de profielfoto op
        ]);
---
INSERT INTO `users` (`name`, `email`, `password`, `profile_picture`, `updated_at`, `created_at`) VALUES ('test tiny', 'Bartvanwijk02@gmail.com', '$2y$12$79wQ4tUoWbiFWtpxzPKPH.9TNvDOsY69wWqY2V73FR7o6FVQWF6ie', 'profile_pictures/QQBm99q2Tips2qTt6VrRnDEcD6fXTkWE2NiyxSFg.jpg', '2024-09-20 07:38:35', '2024-09-20 07:38:35')