app/Http/Controllers/MusclegroupController.php

SELECT * FROM `musclegroups`
---
    public function index()
    {
        $musclegroups = Musclegroup::all(); // Haal alle muscle groups op

INSERT INTO `musclegroups` (`name`, `image`, `updated_at`, `created_at`) VALUES ('Benen', 'images/7weoL8Ffut5VQgJkY3mWHGz9Yl9VvTRrMtw2BaDg.jpg', '2024-09-20 08:03:08', '2024-09-20 08:03:08')
---
    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'image' => 'nullable|image|mimes:jpeg,png,jpg,gif|max:2048',
        ]);

        $musclegroup = new Musclegroup();
        $musclegroup->name = $request->input('name');

        if ($request->hasFile('image')) {
            $imagePath = $request->file('image')->store('images', 'public'); // Opslaan van het bestand
            $musclegroup->image = $imagePath; // Opslaan van het bestandspad in de database
        }

        $musclegroup->save();