app/Http/Controllers/WorkoutController.php

SELECT * FROM `users` WHERE `users`.`id` in (1)
---
    public function index()
    {
        $musclegroups = Musclegroup::all(); // Haal alle spiergroepen op
        $workouts = Workout::with('user')->get(); // Haal alle workouts op, inclusief gebruikersinfo

SELECT * FROM `users` WHERE `users`.`id` = '1' LIMIT 1
SELECT * FROM `workouts` WHERE `user_id` = '1'
---
    public function userWorkouts($userId)
    {
        $user = User::findOrFail($userId);
        $workouts = Workout::where('user_id', $userId)->get(); // Workouts van de specifieke gebruiker