app/Http/Controllers/WorkoutController.php

    public function index()
    {
        $musclegroups = Musclegroup::all(); // Verkrijg alle spiergroepen
        $workouts = Workout::all(); // Verkrijg alle workouts
---
SELECT * FROM `musclegroups`
SELECT * FROM `workouts`

    public function create()
    {
        $musclegroups = Musclegroup::all(); // Haal alle spiergroepen op
---
SELECT * FROM `musclegroups`

    public function edit($id)
    {
        $workout = Workout::findOrFail($id);
        $musclegroups = Musclegroup::all(); // Haal alle spiergroepen op
---
SELECT * FROM `workouts` WHERE `workouts`.`id` = '12' LIMIT 1
SELECT * FROM `musclegroups`

    public function update(CreateOrUpdateWorkoutRequest $request, Workout $workout)
    {
        $workout->update($request->validated());
        $workout->musclegroup()->associate($request->musclegroup_id);
        $workout->save();
---
INSERT INTO `workouts` (`exercise`, `sets`, `reps`, `weight`, `description`, `user_id`, `updated_at`, `created_at`) VALUES ('rows', '231', '213', '12', '<h1>321rewferqgfre</h1>', 1, '2024-09-20 08:12:31', '2024-09-20 08:12:31')